{
    "Options" : {
        "Registration": {
            "Name": "Registration",
            "Emoji": "🤯",
            "Description": "Register for future use of the CE Assistant!",
            "Content": "Registration is key to accessing the functions of CE Assistant. You need to register to use any roll-related commands, check your CR, or update your color! Please use /register with the link to your personal CE page."
        },
        "Rolls": {
            "Name": "Rolls",
            "Emoji": "🧻",
            "Description": "Learn how to roll and about different rolls!",
            "Content": "Rolling is a fun way to try new games! Click below to find out more about all of the solo and co-op roll events!"
        },
        "Rerolls": {
            "Name": "Rerolls",
            "Emoji": "♻️",
            "Description": "Learn how to reroll and about reroll tokens!",
            "Content": "With each roll event you complete, you'll earn a certain amount of reroll tokens. These one-time use tokens allow you to reroll any roll event you're currently participating in - but be sure that's what you want, because some events come with additional cool-down times should you fail a rerolled event!"
        },
        "Update": {
            "Name": "Update",
            "Emoji": "📈",
            "Description": "Learn how to update your profile!",
            "Content": "Updating your profile is simple and quick. Type in /update and within seconds CE Assistant will grab all of your new, updated data from your CE page. P.S. be sure to use this command whenever you complete a rolled game!"
        },
        "Steam Game": {
            "Name": "Steam Game",
            "Emoji": "🎮",
            "Description": "Learn about /steam-game!",
            "Content": "/steam-game is a very simple functoin that just takes in the name of a game and returns information about it from steam and CE. Give it a try with your favorite game!"
        },
        "Admin Options": {
            "Name": "Admin Options",
            "Emoji": "🤫",
            "Description": "Ssh! This is the secret admin command :)",
            "Content": "As an admin, you have access to more commands than regular users. `/add-reason` will add any text you provide to it to the bottom of any message sent by CE Assistant in <#949482536726298666>. This is meant as a way to explain any changes made to games (including removal)."
        },
        "Color Editing": {
            "Name": "Color Editing",
            "Emoji": "🎨",
            "Description": "Learn how to change your color!",
            "Content": "Try /set-color to adjust the color of your name to any unlocked color you have! For example, B Rank users would have access to blue (B), green (C), brown (D), and grey (E)."
        },
        "Check Rolls" : {
            "Name" : "Check Rolls",
            "Emoji" : "🤯",
            "Description" : "Learn how to check your rolls!",
            "Content" : "To check your progress on your current (and completed) rolls, try /check-rolls - see what comes up!"
        }
    },
    "Admin" : {
        "Curate" : {
            "Name" : "Curate",
            "Emoji" : "🌊",
            "Description" : "Learn about /curate!",
            "Content" : "We designed /curate to return the last n games added to the Steam Curator. This should only be used if for some reason the bot misses a curator addition."
        },
        "Add Reason" : {
            "Name" : "Add Reason",
            "Emoji" : "🤔",
            "Description" : "Learn how to add reasoning to any game change!",
            "Content" : "The /add-reason command takes in two parameters: the \"reason\" and the embed-id. This command is intended to be used for adding any specific reasoning to any game changes - ideally removals but this command will work with any kind of embed in the site-additions channel. You do have to retrieve the message-id of the embed you are trying to edit. To learn more about that, look up Discord Developer Mode."
        },
        "Send File" : {
            "Name" : "Send File",
            "Emoji" : "📋",
            "Description" : "Learn about grabbing CE Assistant files!",
            "Content" : "CE Assistant keeps three local databases: name, tier, and user. The name database is where all the information about every game on CE is stored. The tier database is to help pull games for rolling purposes. And the user database stores information about all registered users. /send-file will return to you whichever file you request."
        }
    },
    "Rolls" : {
        "One Hell of a Day" : {
            "Name" : "One Hell of a Day",
            "Emoji" : "\u0030️⃣",
            "Description" : "",
            "Content" : ""
        },
        "One Hell of a Week" : {
            "Name" : "One Hell of a Week",
            "Emoji" : "\u0031⃣",
            "Description" : "",
            "Content" : ""
        },
        "One Hell of a Month" : {
            "Name" : "One Hell of a Month",
            "Emoji" : "\u0032⃣",
            "Description" : "",
            "Content" : ""
        },
        "Two Week T2 Streak" : {
            "Name" : "Two Week T2 Streak",
            "Emoji" : "▶️",
            "Description" : "",
            "Content" : ""
        },
        "Two 'Two Week T2 Streak' Streak" : {
            "Name" : "Two 'Two Week T2 Streak' Streak",
            "Emoji" : "⏩",
            "Description" : "",
            "Content" : ""
        },
        "Never Lucky" : {
            "Name" : "Never Lucky",
            "Emoji" : "🍀",
            "Description" : "",
            "Content" : ""
        },
        "Triple Threat" : {
            "Name" : "Triple Threat",
            "Emoji" : "❄️",
            "Description" : "",
            "Content" : ""
        },
        "Let Fate Decide" : {
            "Name" : "Let Fate Decide",
            "Emoji" : "🌻",
            "Description" : "",
            "Content" : ""
        },
        "Fourward Thinking" : {
            "Name" : "Fourward Thinking",
            "Emoji" : "🙈",
            "Description" : "",
            "Content" : ""
        },
        "Russian Roulette" : {
            "Name" : "Russian Roulette",
            "Emoji" : "💥",
            "Description" : "",
            "Content" : ""
        }
    }
}